Ran Plan for 2 projects:

1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
1. project: `crawlinghub-ecs-scheduler-prod` dir: `terraform/ecs-scheduler` workspace: `default`
---

### 1. project: `crawlinghub-ecs-web-api-prod` dir: `terraform/ecs-web-api` workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place
- destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.web_api will be updated in-place
~ resource "aws_ecs_service" "web_api" {
        id                                 = "arn:aws:ecs:ap-northeast-2:646886795421:service/crawlinghub-cluster-prod/crawlinghub-web-api-prod"
        name                               = "crawlinghub-web-api-prod"
        tags                               = {
            "Environment" = "prod"
            "Service"     = "crawlinghub-web-api-prod"
        }
      ~ task_definition                    = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:27" -> (known after apply)
        # (16 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "web-api" -> null
          - container_port   = 8080 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/crawlinghub-web-api-tg-prod/b5ff3b39019aed4a" -> null
            # (1 unchanged attribute hidden)
        }
      + load_balancer {
          + container_name   = "web-api"
          + container_port   = 8080
          + target_group_arn = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ network_configuration {
          ~ security_groups  = [
              - "sg-0fd7d55bae8cd9bf3",
            ] -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.web_api must be replaced
-/+ resource "aws_ecs_task_definition" "web_api" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod:27" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-2:646886795421:task-definition/crawlinghub-web-api-prod" -> (known after apply)
      ~ container_definitions    = (sensitive value)
      ~ enable_fault_injection   = false -> (known after apply)
      ~ execution_role_arn       = "arn:aws:iam::646886795421:role/crawlinghub-web-api-execution-role-prod" # forces replacement -> (known after apply) # forces replacement
      ~ id                       = "crawlinghub-web-api-prod" -> (known after apply)
      ~ revision                 = 27 -> (known after apply)
        tags                     = {
            "Environment" = "prod"
            "Service"     = "crawlinghub-web-api-prod"
        }
      ~ task_role_arn            = "arn:aws:iam::646886795421:role/crawlinghub-web-api-task-role-prod" # forces replacement -> (known after apply) # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_iam_role.ecs_task will be destroyed
  # (because aws_iam_role.ecs_task is not in configuration)
- resource "aws_iam_role" "ecs_task" {
      - arn                   = "arn:aws:iam::646886795421:role/crawlinghub-web-api-task-role-prod" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-11-20T14:29:59Z" -> null
      - force_detach_policies = false -> null
      - id                    = "crawlinghub-web-api-task-role-prod" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonPrometheusRemoteWriteAccess",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "crawlinghub-web-api-task-role-prod" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
        } -> null
      - unique_id             = "AROAZNHLVFCO3N5EHMTMW" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "crawlinghub-eventbridge-access-prod" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "events:PutEvents",
                              - "events:PutRule",
                              - "events:PutTargets",
                              - "events:DeleteRule",
                              - "events:RemoveTargets",
                            ]
                          - Effect   = "Allow"
                          - Resource = "*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "crawlinghub-web-api-adot-amp-prod" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "aps:RemoteWrite",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                          - Sid      = "AMPRemoteWrite"
                        },
                      - {
                          - Action   = [
                              - "s3:GetObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::connectly-prod/*"
                          - Sid      = "S3ConfigAccess"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "otel-config-s3-access" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "s3:GetObject",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:s3:::connectly-prod/otel-config/*"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role.ecs_task_execution will be destroyed
  # (because aws_iam_role.ecs_task_execution is not in configuration)
- resource "aws_iam_role" "ecs_task_execution" {
      - arn                   = "arn:aws:iam::646886795421:role/crawlinghub-web-api-execution-role-prod" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-11-20T14:29:59Z" -> null
      - force_detach_policies = false -> null
      - id                    = "crawlinghub-web-api-execution-role-prod" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "crawlinghub-web-api-execution-role-prod" -> null
      - path                  = "/" -> null
      - tags                  = {} -> null
      - tags_all              = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
        } -> null
      - unique_id             = "AROAZNHLVFCOZCHTYCKYH" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "crawlinghub-secrets-access-prod" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "secretsmanager:GetSecretValue",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG",
                            ]
                        },
                      - {
                          - Action   = [
                              - "ssm:GetParameters",
                              - "ssm:GetParameter",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:ssm:ap-northeast-2:*:parameter/shared/*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # aws_iam_role_policy.adot_amp_access will be destroyed
  # (because aws_iam_role_policy.adot_amp_access is not in configuration)
- resource "aws_iam_role_policy" "adot_amp_access" {
      - id          = "crawlinghub-web-api-task-role-prod:crawlinghub-web-api-adot-amp-prod" -> null
      - name        = "crawlinghub-web-api-adot-amp-prod" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "aps:RemoteWrite",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                      - Sid      = "AMPRemoteWrite"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::connectly-prod/*"
                      - Sid      = "S3ConfigAccess"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "crawlinghub-web-api-task-role-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.eventbridge_access will be destroyed
  # (because aws_iam_role_policy.eventbridge_access is not in configuration)
- resource "aws_iam_role_policy" "eventbridge_access" {
      - id          = "crawlinghub-web-api-task-role-prod:crawlinghub-eventbridge-access-prod" -> null
      - name        = "crawlinghub-eventbridge-access-prod" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "events:PutEvents",
                          - "events:PutRule",
                          - "events:PutTargets",
                          - "events:DeleteRule",
                          - "events:RemoveTargets",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "crawlinghub-web-api-task-role-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy.secrets_access will be destroyed
  # (because aws_iam_role_policy.secrets_access is not in configuration)
- resource "aws_iam_role_policy" "secrets_access" {
      - id          = "crawlinghub-web-api-execution-role-prod:crawlinghub-secrets-access-prod" -> null
      - name        = "crawlinghub-secrets-access-prod" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG",
                        ]
                    },
                  - {
                      - Action   = [
                          - "ssm:GetParameters",
                          - "ssm:GetParameter",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ssm:ap-northeast-2:*:parameter/shared/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "crawlinghub-web-api-execution-role-prod" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.ecs_task_execution will be destroyed
  # (because aws_iam_role_policy_attachment.ecs_task_execution is not in configuration)
- resource "aws_iam_role_policy_attachment" "ecs_task_execution" {
      - id         = "crawlinghub-web-api-execution-role-prod-20251120143000837000000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy" -> null
      - role       = "crawlinghub-web-api-execution-role-prod" -> null
    }

  # aws_lb.web_api will be destroyed
  # (because aws_lb.web_api is not in configuration)
- resource "aws_lb" "web_api" {
      - arn                                                          = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/crawlinghub-alb-prod/7cee3a518620e82c" -> null
      - arn_suffix                                                   = "app/crawlinghub-alb-prod/7cee3a518620e82c" -> null
      - client_keep_alive                                            = 3600 -> null
      - desync_mitigation_mode                                       = "defensive" -> null
      - dns_name                                                     = "crawlinghub-alb-prod-1970691289.ap-northeast-2.elb.amazonaws.com" -> null
      - drop_invalid_header_fields                                   = false -> null
      - enable_cross_zone_load_balancing                             = true -> null
      - enable_deletion_protection                                   = false -> null
      - enable_http2                                                 = true -> null
      - enable_tls_version_and_cipher_suite_headers                  = false -> null
      - enable_waf_fail_open                                         = false -> null
      - enable_xff_client_port                                       = false -> null
      - enable_zonal_shift                                           = false -> null
      - id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/crawlinghub-alb-prod/7cee3a518620e82c" -> null
      - idle_timeout                                                 = 60 -> null
      - internal                                                     = false -> null
      - ip_address_type                                              = "ipv4" -> null
      - load_balancer_type                                           = "application" -> null
      - name                                                         = "crawlinghub-alb-prod" -> null
      - preserve_host_header                                         = false -> null
      - security_groups                                              = [
          - "sg-0ef60d515aeaa4856",
        ] -> null
      - subnets                                                      = (sensitive value) -> null
      - tags                                                         = {
          - "Environment" = "prod"
          - "Name"        = "crawlinghub-alb-prod"
          - "Service"     = "crawlinghub-web-api-prod"
        } -> null
      - tags_all                                                     = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Name"        = "crawlinghub-alb-prod"
          - "Project"     = "crawlinghub"
          - "Service"     = "crawlinghub-web-api-prod"
        } -> null
      - vpc_id                                                       = "vpc-0f162b9e588276e09" -> null
      - xff_header_processing_mode                                   = "append" -> null
      - zone_id                                                      = "ZWKZPGTI48KDX" -> null
        # (3 unchanged attributes hidden)

      - access_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - connection_logs {
          - enabled = false -> null
            # (2 unchanged attributes hidden)
        }

      - subnet_mapping {
          - subnet_id            = "subnet-0bd2fc282b0fb137a" -> null
            # (4 unchanged attributes hidden)
        }
      - subnet_mapping {
          - subnet_id            = "subnet-0c8c0ad85064b80bb" -> null
            # (4 unchanged attributes hidden)
        }
    }

  # aws_lb_listener.http will be destroyed
  # (because aws_lb_listener.http is not in configuration)
- resource "aws_lb_listener" "http" {
      - arn                                                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/7cee3a518620e82c/ad6b59d33493d0fa" -> null
      - id                                                                  = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/7cee3a518620e82c/ad6b59d33493d0fa" -> null
      - load_balancer_arn                                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/crawlinghub-alb-prod/7cee3a518620e82c" -> null
      - port                                                                = 80 -> null
      - protocol                                                            = "HTTP" -> null
      - routing_http_response_server_enabled                                = true -> null
      - tags                                                                = {} -> null
      - tags_all                                                            = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
        } -> null
        # (11 unchanged attributes hidden)

      - default_action {
          - order            = 1 -> null
          - type             = "redirect" -> null
            # (1 unchanged attribute hidden)

          - redirect {
              - host        = "#{host}" -> null
              - path        = "/#{path}" -> null
              - port        = "443" -> null
              - protocol    = "HTTPS" -> null
              - query       = "#{query}" -> null
              - status_code = "HTTP_301" -> null
            }
        }
    }

  # aws_lb_listener.https will be destroyed
  # (because aws_lb_listener.https is not in configuration)
- resource "aws_lb_listener" "https" {
      - arn                                                                   = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/7cee3a518620e82c/c4bad3409d59ea6c" -> null
      - certificate_arn                                                       = (sensitive value) -> null
      - id                                                                    = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:listener/app/crawlinghub-alb-prod/7cee3a518620e82c/c4bad3409d59ea6c" -> null
      - load_balancer_arn                                                     = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/crawlinghub-alb-prod/7cee3a518620e82c" -> null
      - port                                                                  = 443 -> null
      - protocol                                                              = "HTTPS" -> null
      - routing_http_response_server_enabled                                  = true -> null
      - ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06" -> null
      - tags                                                                  = {} -> null
      - tags_all                                                              = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Project"     = "crawlinghub"
        } -> null
        # (18 unchanged attributes hidden)

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/crawlinghub-web-api-tg-prod/b5ff3b39019aed4a" -> null
          - type             = "forward" -> null
        }

      - mutual_authentication {
          - ignore_client_certificate_expiry = false -> null
          - mode                             = "off" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.web_api will be destroyed
  # (because aws_lb_target_group.web_api is not in configuration)
- resource "aws_lb_target_group" "web_api" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/crawlinghub-web-api-tg-prod/b5ff3b39019aed4a" -> null
      - arn_suffix                         = "targetgroup/crawlinghub-web-api-tg-prod/b5ff3b39019aed4a" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:targetgroup/crawlinghub-web-api-tg-prod/b5ff3b39019aed4a" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ap-northeast-2:646886795421:loadbalancer/app/crawlinghub-alb-prod/7cee3a518620e82c",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "crawlinghub-web-api-tg-prod" -> null
      - port                               = 8080 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Environment" = "prod"
          - "Name"        = "crawlinghub-web-api-tg-prod"
        } -> null
      - tags_all                           = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Name"        = "crawlinghub-web-api-tg-prod"
          - "Project"     = "crawlinghub"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = (sensitive value) -> null
        # (1 unchanged attribute hidden)

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 30 -> null
          - matcher             = "200" -> null
          - path                = "/actuator/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

  # aws_route53_record.web_api will be updated in-place
~ resource "aws_route53_record" "web_api" {
        id                               = "Z104656329CL6XBYE8OIJ_crawler.set-of.com_A"
        name                             = "crawler.set-of.com"
        # (8 unchanged attributes hidden)

      ~ alias {
          ~ name                   = "crawlinghub-alb-prod-1970691289.ap-northeast-2.elb.amazonaws.com" -> (known after apply)
          ~ zone_id                = "ZWKZPGTI48KDX" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # aws_security_group.alb will be destroyed
  # (because aws_security_group.alb is not in configuration)
- resource "aws_security_group" "alb" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-0ef60d515aeaa4856" -> null
      - description            = "Security group for ALB" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-0ef60d515aeaa4856" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTP for redirect"
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "HTTPS from anywhere"
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 443
            },
        ] -> null
      - name                   = "crawlinghub-alb-sg-prod" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "crawlinghub-alb-sg-prod"
        } -> null
      - tags_all               = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Name"        = "crawlinghub-alb-sg-prod"
          - "Project"     = "crawlinghub"
        } -> null
      - vpc_id                 = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.ecs_web_api will be destroyed
  # (because aws_security_group.ecs_web_api is not in configuration)
- resource "aws_security_group" "ecs_web_api" {
      - arn                    = "arn:aws:ec2:ap-northeast-2:646886795421:security-group/sg-0fd7d55bae8cd9bf3" -> null
      - description            = "Security group for web-api ECS tasks" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - id                     = "sg-0fd7d55bae8cd9bf3" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "From ALB only"
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0ef60d515aeaa4856",
                ]
              - self             = false
              - to_port          = 8080
            },
        ] -> null
      - name                   = "crawlinghub-web-api-sg-prod" -> null
      - owner_id               = "646886795421" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "crawlinghub-web-api-sg-prod"
        } -> null
      - tags_all               = {
          - "Environment" = "prod"
          - "ManagedBy"   = "terraform"
          - "Name"        = "crawlinghub-web-api-sg-prod"
          - "Project"     = "crawlinghub"
        } -> null
      - vpc_id                 = (sensitive value) -> null
        # (1 unchanged attribute hidden)
    }

  # module.alb.aws_lb.this will be created
+ resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = "ipv4"
      + load_balancer_type                                           = "application"
      + name                                                         = "crawlinghub-alb-prod"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = (sensitive value)
      + tags                                                         = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Application Load Balancer crawlinghub-alb-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all                                                     = {
          + "Component"   = "load-balancer"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Application Load Balancer crawlinghub-alb-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)
    }

  # module.alb.aws_lb_listener.http["http-redirect"] will be created
+ resource "aws_lb_listener" "http" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "HTTP listener for crawlinghub-alb-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-prod-http-http-redirect"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all                                                              = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "HTTP listener for crawlinghub-alb-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-prod-http-http-redirect"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.alb.aws_lb_listener.https["https"] will be created
+ resource "aws_lb_listener" "https" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = (sensitive value)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags                                                                  = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "HTTPS listener for crawlinghub-alb-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-prod-https-https"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all                                                              = {
          + "Component"   = "listener"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "HTTPS listener for crawlinghub-alb-prod"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-prod-https-https"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.this["web-api"] will be created
+ resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "crawlinghub-alb-prod-web-api"
      + name_prefix                        = (known after apply)
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Component"   = "target-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Target group for crawlinghub-alb-prod - web-api"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-prod-web-api"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all                           = {
          + "Component"   = "target-group"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Target group for crawlinghub-alb-prod - web-api"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-prod-web-api"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + target_type                        = "ip"
      + vpc_id                             = (sensitive value)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/actuator/health"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

  # module.alb_security_group.aws_security_group.this will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for ALB"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "crawlinghub-alb-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Security group for ALB"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
          + "Type"        = "alb"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Security group for ALB"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
          + "Type"        = "alb"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.alb_security_group.aws_vpc_security_group_egress_rule.default[0] will be created
+ resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
    }

  # module.alb_security_group.aws_vpc_security_group_ingress_rule.alb-http["0.0.0.0/0"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "alb-http" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTP traffic from internet"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-sg-prod-http-ingress-0.0.0.0-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-sg-prod-http-ingress-0.0.0.0-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + to_port                = 80
    }

  # module.alb_security_group.aws_vpc_security_group_ingress_rule.alb-https["0.0.0.0/0"] will be created
+ resource "aws_vpc_security_group_ingress_rule" "alb-https" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow HTTPS traffic from internet"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-sg-prod-https-ingress-0.0.0.0-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-alb-sg-prod-https-ingress-0.0.0.0-0"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + to_port                = 443
    }

  # module.ecs_security_group.aws_security_group.this will be created
+ resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for web-api ECS tasks"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "crawlinghub-web-api-sg-prod"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Security group for web-api ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
          + "Type"        = "ecs"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Description" = "Security group for web-api ECS tasks"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-sg-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
          + "Type"        = "ecs"
        }
      + vpc_id                 = (sensitive value)
    }

  # module.ecs_security_group.aws_vpc_security_group_egress_rule.default[0] will be created
+ resource "aws_vpc_security_group_egress_rule" "default" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow all outbound traffic"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all               = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-sg-prod-default-egress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
    }

  # module.ecs_security_group.aws_vpc_security_group_ingress_rule.ecs-from-alb[0] will be created
+ resource "aws_vpc_security_group_ingress_rule" "ecs-from-alb" {
      + arn                          = (known after apply)
      + description                  = "Allow traffic from ALB to ECS container"
      + from_port                    = 8080
      + id                           = (known after apply)
      + ip_protocol                  = "tcp"
      + referenced_security_group_id = (known after apply)
      + security_group_id            = (known after apply)
      + security_group_rule_id       = (known after apply)
      + tags                         = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-sg-prod-from-alb-ingress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all                     = {
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-sg-prod-from-alb-ingress"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + to_port                      = 8080
    }

  # module.ecs_task_execution_role.aws_iam_role.this will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for crawlinghub-web-api-execution-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawlinghub-web-api-execution-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-execution-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs_task_execution_role.aws_iam_role_policy.custom["ssm-access"] will be created
+ resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "crawlinghub-web-api-execution-role-prod-ssm-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ssm:ap-northeast-2:*:parameter/shared/*",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ecs_task_execution_role.aws_iam_role_policy.secrets-manager[0] will be created
+ resource "aws_iam_role_policy" "secrets-manager" {
      + id          = (known after apply)
      + name        = "crawlinghub-web-api-execution-role-prod-secrets-manager"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:ap-northeast-2:646886795421:secret:crawlinghub/rds/credentials-6wYxDG",
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ecs_task_execution_role.aws_iam_role_policy_attachment.aws-managed["arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"] will be created
+ resource "aws_iam_role_policy_attachment" "aws-managed" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "crawlinghub-web-api-execution-role-prod"
    }

  # module.ecs_task_role.aws_iam_role.this will be created
+ resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for crawlinghub-web-api-task-role-prod"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "crawlinghub-web-api-task-role-prod"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + tags_all              = {
          + "Component"   = "iam-role"
          + "CostCenter"  = "engineering"
          + "DataClass"   = "confidential"
          + "Environment" = "prod"
          + "Lifecycle"   = "production"
          + "ManagedBy"   = "terraform"
          + "Name"        = "crawlinghub-web-api-task-role-prod"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "crawlinghub"
          + "Service"     = "crawlinghub-web-api"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs_task_role.aws_iam_role_policy.custom["adot-amp-access"] will be created
+ resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "crawlinghub-web-api-task-role-prod-adot-amp-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "aps:RemoteWrite",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:aps:ap-northeast-2:*:workspace/*"
                      + Sid      = "AMPRemoteWrite"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::connectly-prod/*"
                      + Sid      = "S3ConfigAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ecs_task_role.aws_iam_role_policy.custom["eventbridge-access"] will be created
+ resource "aws_iam_role_policy" "custom" {
      + id          = (known after apply)
      + name        = "crawlinghub-web-api-task-role-prod-eventbridge-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "events:PutEvents",
                          + "events:PutRule",
                          + "events:PutTargets",
                          + "events:DeleteRule",
                          + "events:RemoveTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.web_api_logs.aws_cloudwatch_log_group.this will be updated in-place
~ resource "aws_cloudwatch_log_group" "this" {
        id                = "/aws/ecs/crawlinghub-web-api-prod/application"
        name              = "/aws/ecs/crawlinghub-web-api-prod/application"
      ~ tags              = {
            "Component"     = "log-group"
            "CostCenter"    = "engineering"
            "DataClass"     = "confidential"
            "Environment"   = "prod"
            "ExportToS3"    = "disabled"
            "KMSEncrypted"  = "false
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.